# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [6]:
cur.execute("""select firstName, lastName,
               city, state
               from employees join offices
               using(officeCode)
               order by firstName asc,
               lastName asc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [10]:
cur.execute("""select contactFirstName as firstName,
                      contactLastName as lastName,
                      orderNumber, status
                      from customers
                      join orders using(customerNumber)
                      order by lastName asc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName  lastName orderNumber   status
0    Paolo    Accorti       10280  Shipped
1    Paolo    Accorti       10293  Shipped
2    Rachel  Ashworth       10110  Shipped
3    Rachel  Ashworth       10306  Shipped
4    Rachel  Ashworth       10332  Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [12]:
cur.execute("""select contactFirstName as firstName,
                      contactLastName as lastName,
                      amount, paymentDate
                      from customers
                      join payments using(customerNumber)
                      order by lastName asc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName  lastName    amount paymentDate
0    Paolo    Accorti  48298.99  2004-09-04
1    Paolo    Accorti  33924.24  2004-09-19
2    Rachel  Ashworth  48425.69  2003-03-27
3    Rachel  Ashworth  52825.29  2004-11-03
4    Rachel  Ashworth  47159.11  2004-12-08

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [15]:
cur.execute("""select contactFirstName as firstName,
                      contactLastName as lastName,
                      productName, quantityOrdered,orderDate
                      from customers
                      join orders using(customerNumber)
                      join orderdetails using(orderNumber)
                      join products using(productCode)
                      order by lastName asc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

,firstName,lastName,productName,quantityOrdered,orderDate
0,Paolo,Accorti,1952 Alpine Renault 1300,34,2004-08-17
1,Paolo,Accorti,1940 Ford Pickup Truck,24,2004-08-17
2,Paolo,Accorti,1937 Lincoln Berline,50,2004-08-17
3,Paolo,Accorti,1936 Mercedes-Benz 500K Special Roadster,27,2004-08-17
4,Paolo,Accorti,1917 Grand Touring Sedan,26,2004-08-17

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!